{
    "class_name": "Model",
    "config": {
        "name": "vgg16",
        "layers": [
            {
                "class_name": "Addmm",
                "config": {
                    "bias": "(200)",
                    "layer_id": "None"
                },
                "name": "fc",
                "inbound_nodes": [
                    [
                        [
                            "139619857917904-View"
                        ],
                        [
                            "fc1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "139619857917904-View",
                "inbound_nodes": [
                    [
                        [
                            "139619857951504-View"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "139619857951504-View",
                "inbound_nodes": [
                    [
                        [
                            "139619857949648-Mean1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Mean1",
                "config": "None",
                "name": "139619857949648-Mean1",
                "inbound_nodes": [
                    [
                        [
                            "139619857950288-View"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "139619857950288-View",
                "inbound_nodes": [
                    [
                        [
                            "139619857997648-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619857997648-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139619857995856-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139619857995856-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer4.2.bn3"
                        ],
                        [
                            "139619857993872-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(1639)",
                    "weight": "(1639)",
                    "layer_id": "139621609566544"
                },
                "name": "layer4.2.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer4.2.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(1639, 410, 1, 1)",
                    "layer_id": "139621609567056"
                },
                "name": "layer4.2.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139619857997136-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619857997136-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.2.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139621609569296"
                },
                "name": "layer4.2.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer4.2.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 410, 3, 3)",
                    "layer_id": "139621609568016"
                },
                "name": "layer4.2.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139619858032400-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619858032400-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.2.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139621609681936"
                },
                "name": "layer4.2.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.2.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 1639, 1, 1)",
                    "layer_id": "139621609682192"
                },
                "name": "layer4.2.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139619857993872-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619857993872-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139619858065360-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139619858065360-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.bn3"
                        ],
                        [
                            "139619858067344-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(1639)",
                    "weight": "(1639)",
                    "layer_id": "139621609683664"
                },
                "name": "layer4.1.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(1639, 410, 1, 1)",
                    "layer_id": "139621609684048"
                },
                "name": "layer4.1.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139619857576208-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619857576208-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139621609667856"
                },
                "name": "layer4.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 410, 3, 3)",
                    "layer_id": "139621609666512"
                },
                "name": "layer4.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139619860690832-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619860690832-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139621609666576"
                },
                "name": "layer4.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 1639, 1, 1)",
                    "layer_id": "139621609667280"
                },
                "name": "layer4.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139619858067344-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619858067344-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139619860220112-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139619860220112-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.bn3"
                        ],
                        [
                            "layer4.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(1639)",
                    "weight": "(1639)",
                    "layer_id": "139621609640080"
                },
                "name": "layer4.0.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(1639, 410, 1, 1)",
                    "layer_id": "139621609641808"
                },
                "name": "layer4.0.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139619860234960-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619860234960-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139621609643408"
                },
                "name": "layer4.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 410, 3, 3)",
                    "layer_id": "139621609642000"
                },
                "name": "layer4.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139619860266320-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619860266320-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139621609625616"
                },
                "name": "layer4.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 820, 1, 1)",
                    "layer_id": "139621609624784"
                },
                "name": "layer4.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139619860249552-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139619860249552-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609706576-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609706576-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.5.bn3"
                        ],
                        [
                            "139621609707984-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(820)",
                    "weight": "(820)",
                    "layer_id": "139621609626896"
                },
                "name": "layer3.5.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer3.5.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(820, 205, 1, 1)",
                    "layer_id": "139621609627344"
                },
                "name": "layer3.5.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139621609595472-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609595472-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.5.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139621609598544"
                },
                "name": "layer3.5.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.5.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 205, 3, 3)",
                    "layer_id": "139621609597200"
                },
                "name": "layer3.5.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139621609626960-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609626960-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.5.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139621609596368"
                },
                "name": "layer3.5.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.5.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 820, 1, 1)",
                    "layer_id": "139621609597008"
                },
                "name": "layer3.5.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139621609707984-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609707984-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609640848-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609640848-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.4.bn3"
                        ],
                        [
                            "139621609643664-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(820)",
                    "weight": "(820)",
                    "layer_id": "139621609596432"
                },
                "name": "layer3.4.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer3.4.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(820, 205, 1, 1)",
                    "layer_id": "139621609595088"
                },
                "name": "layer3.4.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139621609641488-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609641488-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.4.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139621609706640"
                },
                "name": "layer3.4.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.4.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 205, 3, 3)",
                    "layer_id": "139621609707024"
                },
                "name": "layer3.4.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139621609668560-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609668560-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.4.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139621609708240"
                },
                "name": "layer3.4.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.4.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 820, 1, 1)",
                    "layer_id": "139628233037072"
                },
                "name": "layer3.4.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139621609643664-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609643664-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609683088-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609683088-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.3.bn3"
                        ],
                        [
                            "139621609569168-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(820)",
                    "weight": "(820)",
                    "layer_id": "139619860674448"
                },
                "name": "layer3.3.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer3.3.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(820, 205, 1, 1)",
                    "layer_id": "139619860672784"
                },
                "name": "layer3.3.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139621609569488-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609569488-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.3.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619860250576"
                },
                "name": "layer3.3.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.3.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 205, 3, 3)",
                    "layer_id": "139619860248528"
                },
                "name": "layer3.3.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139625025566608-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139625025566608-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.3.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619860266192"
                },
                "name": "layer3.3.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.3.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 820, 1, 1)",
                    "layer_id": "139619860265360"
                },
                "name": "layer3.3.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139621609569168-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609569168-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609653456-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609653456-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.2.bn3"
                        ],
                        [
                            "139621609652368-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(820)",
                    "weight": "(820)",
                    "layer_id": "139619860264336"
                },
                "name": "layer3.2.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer3.2.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(820, 205, 1, 1)",
                    "layer_id": "139619860263120"
                },
                "name": "layer3.2.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139621609655888-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609655888-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.2.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619860234448"
                },
                "name": "layer3.2.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.2.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 205, 3, 3)",
                    "layer_id": "139619860236944"
                },
                "name": "layer3.2.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139625025716944-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139625025716944-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.2.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619860220752"
                },
                "name": "layer3.2.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.2.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 820, 1, 1)",
                    "layer_id": "139619860219856"
                },
                "name": "layer3.2.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139621609652368-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609652368-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609522704-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609522704-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.bn3"
                        ],
                        [
                            "139621609522448-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(820)",
                    "weight": "(820)",
                    "layer_id": "139619860218704"
                },
                "name": "layer3.1.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(820, 205, 1, 1)",
                    "layer_id": "139619860196816"
                },
                "name": "layer3.1.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139621609524112-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609524112-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619860196496"
                },
                "name": "layer3.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 205, 3, 3)",
                    "layer_id": "139619860195216"
                },
                "name": "layer3.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139625293657552-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139625293657552-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619860690576"
                },
                "name": "layer3.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 820, 1, 1)",
                    "layer_id": "139619860689680"
                },
                "name": "layer3.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139621609522448-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609522448-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609585488-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609585488-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.bn3"
                        ],
                        [
                            "layer3.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(820)",
                    "weight": "(820)",
                    "layer_id": "139619857619280"
                },
                "name": "layer3.0.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(820, 205, 1, 1)",
                    "layer_id": "139619857618896"
                },
                "name": "layer3.0.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139621609583568-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609583568-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619857617680"
                },
                "name": "layer3.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 205, 3, 3)",
                    "layer_id": "139619857617296"
                },
                "name": "layer3.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139621609486480-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609486480-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(205)",
                    "weight": "(205)",
                    "layer_id": "139619857579152"
                },
                "name": "layer3.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(205, 410, 1, 1)",
                    "layer_id": "139619857578896"
                },
                "name": "layer3.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139621609487440-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609487440-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609485456-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609485456-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer2.3.bn3"
                        ],
                        [
                            "139625025680528-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139619857577232"
                },
                "name": "layer2.3.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer2.3.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 103, 1, 1)",
                    "layer_id": "139619857576848"
                },
                "name": "layer2.3.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139625025683280-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139625025683280-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.3.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(103)",
                    "weight": "(103)",
                    "layer_id": "139619858067088"
                },
                "name": "layer2.3.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer2.3.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(103, 103, 3, 3)",
                    "layer_id": "139619858066704"
                },
                "name": "layer2.3.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139621609613392-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609613392-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.3.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(103)",
                    "weight": "(103)",
                    "layer_id": "139619858065488"
                },
                "name": "layer2.3.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.3.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(103, 410, 1, 1)",
                    "layer_id": "139619858065232"
                },
                "name": "layer2.3.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139625025680528-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139625025680528-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139621609612176-Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "139621609612176-Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer2.2.bn3"
                        ],
                        [
                            "139621609613520-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(410)",
                    "weight": "(410)",
                    "layer_id": "139619858063760"
                },
                "name": "layer2.2.bn3",
                "inbound_nodes": [
                    [
                        [
                            "layer2.2.conv3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(410, 103, 1, 1)",
                    "layer_id": "139619858034640"
                },
                "name": "layer2.2.conv3",
                "inbound_nodes": [
                    [
                        [
                            "139625293783440-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139625293783440-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.2.bn2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(103)",
                    "weight": "(103)",
                    "layer_id": "139619858033424"
                },
                "name": "layer2.2.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer2.2.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(103, 103, 3, 3)",
                    "layer_id": "139619858033040"
                },
                "name": "layer2.2.conv2",
                "inbound_nodes": [
                    [
                        [
                            "139625025675408-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139625025675408-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.2.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(103)",
                    "weight": "(103)",
                    "layer_id": "139619858031824"
                },
                "name": "layer2.2.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.2.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(103, 410, 1, 1)",
                    "layer_id": "139619858031568"
                },
                "name": "layer2.2.conv1",
                "inbound_nodes": [
                    [
                        [
                            "139621609613520-Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "139621609613520-Relu1",
                "inbound_nodes": [
                    [
                        [
                            "139625025675536-Add0"
